{"backend": "tensorflow", "config": {"output_layers": [["dense_3", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 40, 13, 1]}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"padding": "same", "name": "conv2d_1", "bias_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "filters": 100, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3]}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"padding": "same", "name": "max_pooling2d_1", "dtype": "float32", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"padding": "same", "name": "conv2d_2", "bias_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "filters": 20, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3]}, "class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"padding": "same", "name": "max_pooling2d_2", "dtype": "float32", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"padding": "same", "name": "conv2d_3", "bias_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "filters": 5, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3]}, "class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"padding": "same", "name": "max_pooling2d_3", "dtype": "float32", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "flatten_1", "dtype": "float32", "data_format": "channels_last"}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"config": {"name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 500, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activation": "relu"}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1000, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activation": "relu"}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 520, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activation": "linear"}, "class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}]}, "class_name": "Model", "keras_version": "2.3.1"}