{"keras_version": "2.3.1", "backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "name": "encoder_input", "config": {"sparse": false, "name": "encoder_input", "batch_input_shape": [null, 40, 20, 1], "dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["encoder_input", 0, 0, {}]]], "name": "conv2d_1", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "padding": "same", "name": "conv2d_1", "use_bias": true, "trainable": true, "filters": 64, "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "strides": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "padding": "same", "name": "conv2d_2", "use_bias": true, "trainable": true, "filters": 32, "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "strides": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "flatten_1", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1", "dtype": "float32"}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "latent_vector", "config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "latent_vector", "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "units": 10, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "name": "encoder", "input_layers": [["encoder_input", 0, 0]], "output_layers": [["latent_vector", 0, 0]]}, "class_name": "Model"}