{"keras_version": "2.3.1", "class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 20, 13, 1]}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"dtype": "float32", "strides": [1, 1], "name": "conv2d_1", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "filters": 50, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "same", "dtype": "float32"}, "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dtype": "float32", "strides": [1, 1], "name": "conv2d_2", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "filters": 20, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "same", "dtype": "float32"}, "name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dtype": "float32", "strides": [1, 1], "name": "conv2d_3", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "filters": 5, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "padding": "same", "dtype": "float32"}, "name": "max_pooling2d_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1", "dtype": "float32"}, "name": "flatten_1", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 500, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32"}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 260, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32"}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "output_layers": [["dense_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}